app/controllers/api/play_lists_controller.rb

    def create
      @play_list = PlayList.new(play_list_params)

      if @play_list.save
---
INSERT INTO "play_lists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "list_name"], ["user_id", 1], ["created_at", "2019-01-07 07:31:40.733531"], ["updated_at", "2019-01-07 07:31:40.733531"]]

    def update
      if @play_list.update(play_list_params)
---
UPDATE "play_lists" SET "name" = ?, "updated_at" = ? WHERE "play_lists"."id" = ?  [["name", "new name"], ["updated_at", "2019-01-07 07:31:40.787506"], ["id", 1]]

    def destroy
      @play_list.destroy
---
DELETE FROM "mp3s_play_lists" WHERE "mp3s_play_lists"."play_list_id" = ?  [["play_list_id", 1]]
DELETE FROM "play_lists" WHERE "play_lists"."id" = ?  [["id", 1]]

    def add_mp3
      if @play_list && @mp3
        @play_list.mp3s << @mp3
---
INSERT INTO "mp3s_play_lists" ("play_list_id", "mp3_id") VALUES (?, ?)  [["play_list_id", 1], ["mp3_id", 1]]

    def remove_mp3
      if @play_list && @mp3
        @play_list.mp3s.delete(@mp3)
---
DELETE FROM "mp3s_play_lists" WHERE "mp3s_play_lists"."play_list_id" = ? AND "mp3s_play_lists"."mp3_id" = ?  [["play_list_id", 1], ["mp3_id", 1]]

      def set_play_list
        @play_list = current_user.play_lists.find_by_id(params[:id])
---
SELECT  "play_lists".* FROM "play_lists" WHERE "play_lists"."user_id" = ? AND "play_lists"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

      def set_mp3
        @mp3 = Mp3.find_by_id(mp3_params[:mp3_id])
---
SELECT  "mp3s".* FROM "mp3s" WHERE "mp3s"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]