app/controllers/api/sessions_controller.rb

    def login
      resource = User.find_for_database_authentication(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "libby@wisozkschuppe.biz"], ["LIMIT", 1]]