app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "user_name", "email", "created_at", "updated_at", "encrypted_password") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      @user = User.new(user_params)

      if @user.save

UPDATE "users" SET "encrypted_password" = ?, "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$04$X9XyM/egeIZom5xVZ9bpH.UxExXLRppgLasqWpmlBdCZ.y68uWm2y"], ["first_name", "new name"], ["updated_at", "2019-01-07 07:47:44.014030"], ["id", 1]]
---
    def update
      if current_user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def destroy
      current_user.destroy