app/views/users/index.html.erb


      <% if user.play_lists.present? %>
---
SELECT "play_lists".* FROM "play_lists" WHERE "play_lists"."user_id" = ?  [["user_id", 1]]